{"_id": "68671bc3a2aa5605ccf0f512", "title": "Council of Europe Framework Convention on Artificial Intelligence and Human Rights, Democracy, and the Rule of Law", "source": "https://rm.coe.int/1680afae3c", "text": "Council of Europe Treaty Series - No. 225\nCouncil of Europe Framework Convention on Artificial Intelligence and Human\nRights, Democracy and the Rule of Law\nVilnius, 5.IX.2024\nPreamble\nThe member States of the Council of Europe and the other signatories hereto,\nConsidering that the aim of the Council of Europe is to achieve greater unity between its\nmembers, based in particular on the respect for human rights, democracy and the rule of law;\nRecognising the value of fostering co-operation between the Parties to this Convention and of\nextending such co-operation to other States that share the same values;\nConscious of the accelerating developments in science and technology and the profound\nchanges brought about through activities within the lifecycle of artificial intelligence systems,\nwhich have the potential to promote human prosperity as well as individual and societal wellbeing, sustainable development, gender equality and the empowerment of all women and girls,\nas well as other important goals and interests, by enhancing progress and innovation;\nRecognising that activities within the lifecycle of artificial intelligence systems may offer\nunprecedented opportunities to protect and promote human rights, democracy and the rule of\nlaw;\nConcerned that certain activities within the lifecycle of artificial intelligence systems may\nundermine human dignity and individual autonomy, human rights, democracy and the rule of\nlaw;\nConcerned about the risks of discrimination in digital contexts, particularly those involving\nartificial intelligence systems, and their potential effect of creating or aggravating inequalities,\nincluding those experienced by women and individuals in vulnerable situations, regarding the\nenjoyment of their human rights and their full, equal and effective participation in economic,\nsocial, cultural and political affairs;\nConcerned by the misuse of artificial intelligence systems and opposing the use of such\nsystems for repressive purposes in violation of international human rights law, including through\narbitrary or unlawful surveillance and censorship practices that erode privacy and individual\nautonomy;\nConscious of the fact that human rights, democracy and the rule of law are inherently\ninterwoven;\nCETS 225 – Artificial Intelligence, 5.IX.2024\n__________________________________________________________________________________\n2\nConvinced of the need to establish, as a matter of priority, a globally applicable legal framework\nsetting out common general principles and rules governing the activities within the lifecycle of\nartificial intelligence systems that effectively preserves shared values and harnesses the\nbenefits of artificial intelligence for the promotion of these values in a manner conducive to\nresponsible innovation;\nRecognising the need to promote digital literacy, knowledge about, and trust in the design,\ndevelopment, use and decommissioning of artificial intelligence systems;\nRecognising the framework character of this Convention, which may be supplemented by\nfurther instruments to address specific issues relating to the activities within the lifecycle of\nartificial intelligence systems;\nUnderlining that this Convention is intended to address specific challenges which arise\nthroughout the lifecycle of artificial intelligence systems and encourage the consideration of the\nwider risks and impacts related to these technologies including, but not limited to, human health\nand the environment, and socio-economic aspects, such as employment and labour;\nNoting relevant efforts to advance international understanding and co-operation on artificial\nintelligence by other international and supranational organisations and fora;\nMindful of applicable international human rights instruments, such as the 1948 Universal\nDeclaration of Human Rights, the 1950 Convention for the Protection of Human Rights and\nFundamental Freedoms (ETS No. 5), the 1966 International Covenant on Civil and Political\nRights, the 1966 International Covenant on Economic, Social and Cultural Rights, the 1961\nEuropean Social Charter (ETS No. 35), as well as their respective protocols, and the 1996\nEuropean Social Charter (Revised) (ETS No. 163);\nMindful also of the 1989 United Nations Convention on the Rights of the Child and the 2006\nUnited Nations Convention on the Rights of Persons with Disabilities;\nMindful also of the privacy rights of individuals and the protection of personal data, as applicable\nand conferred, for example, by the 1981 Convention for the Protection of Individuals with regard\nto Automatic Processing of Personal Data (ETS No. 108) and its protocols;\nAffirming the commitment of the Parties to protecting human rights, democracy and the rule of\nlaw, and fostering trustworthiness of artificial intelligence systems through this Convention,\nHave agreed as follows:\nChapter I – General provisions\nArticle 1 – Object and purpose\n1 The provisions of this Convention aim to ensure that activities within the lifecycle of artificial\nintelligence systems are fully consistent with human rights, democracy and the rule of law.\n2 Each Party shall adopt or maintain appropriate legislative, administrative or other measures to\ngive effect to the provisions set out in this Convention. These measures shall be graduated and\ndifferentiated as may be necessary in view of the severity and probability of the occurrence of\nadverse impacts on human rights, democracy and the rule of law throughout the lifecycle of\nartificial intelligence systems. This may include specific or horizontal measures that apply\nirrespective of the type of technology used.\nCETS 225 – Artificial Intelligence, 5.IX.2024\n__________________________________________________________________________________\n3\n3 In order to ensure effective implementation of its provisions by the Parties, this Convention\nestablishes a follow-up mechanism and provides for international co-operation.\nArticle 2 – Definition of artificial intelligence systems\nFor the purposes of this Convention, “artificial intelligence system” means a machine-based\nsystem that, for explicit or implicit objectives, infers, from the input it receives, how to generate\noutputs such as predictions, content, recommendations or decisions that may influence\nphysical or virtual environments. Different artificial intelligence systems vary in their levels of\nautonomy and adaptiveness after deployment.\nArticle 3 – Scope\n1 The scope of this Convention covers the activities within the lifecycle of artificial intelligence\nsystems that have the potential to interfere with human rights, democracy and the rule of law\nas follows:\na Each Party shall apply this Convention to the activities within the lifecycle of artificial\nintelligence systems undertaken by public authorities, or private actors acting on their\nbehalf.\nb Each Party shall address risks and impacts arising from activities within the lifecycle of\nartificial intelligence systems by private actors to the extent not covered in subparagraph\na in a manner conforming with the object and purpose of this Convention.\nEach Party shall specify in a declaration submitted to the Secretary General of the Council\nof Europe at the time of signature, or when depositing its instrument of ratification,\nacceptance, approval or accession, how it intends to implement this obligation, either by\napplying the principles and obligations set forth in Chapters II to VI of this Convention to\nactivities of private actors or by taking other appropriate measures to fulfil the obligation\nset out in this subparagraph. Parties may, at any time and in the same manner, amend\ntheir declarations.\nWhen implementing the obligation under this subparagraph, a Party may not derogate from\nor limit the application of its international obligations undertaken to protect human rights,\ndemocracy and the rule of law.\n2 A Party shall not be required to apply this Convention to activities within the lifecycle of artificial\nintelligence systems related to the protection of its national security interests, with the\nunderstanding that such activities are conducted in a manner consistent with applicable\ninternational law, including international human rights law obligations, and with respect for its\ndemocratic institutions and processes.\n3 Without prejudice to Article 13 and Article 25, paragraph 2, this Convention shall not apply to\nresearch and development activities regarding artificial intelligence systems not yet made\navailable for use, unless testing or similar activities are undertaken in such a way that they have\nthe potential to interfere with human rights, democracy and the rule of law.\n4 Matters relating to national defence do not fall within the scope of this Convention.\nCETS 225 – Artificial Intelligence, 5.IX.2024\n__________________________________________________________________________________\n4\nChapter II – General obligations\nArticle 4 – Protection of human rights\nEach Party shall adopt or maintain measures to ensure that the activities within the lifecycle of\nartificial intelligence systems are consistent with obligations to protect human rights, as\nenshrined in applicable international law and in its domestic law.\nArticle 5 – Integrity of democratic processes and respect for the rule of law\n1 Each Party shall adopt or maintain measures that seek to ensure that artificial intelligence\nsystems are not used to undermine the integrity, independence and effectiveness of democratic\ninstitutions and processes, including the principle of the separation of powers, respect for\njudicial independence and access to justice.\n2 Each Party shall adopt or maintain measures that seek to protect its democratic processes in\nthe context of activities within the lifecycle of artificial intelligence systems, including individuals’\nfair access to and participation in public debate, as well as their ability to freely form opinions.\nChapter III – Principles related to activities within the lifecycle of artificial intelligence systems\nArticle 6 – General approach\nThis chapter sets forth general common principles that each Party shall implement in regard to\nartificial intelligence systems in a manner appropriate to its domestic legal system and the other\nobligations of this Convention.\nArticle 7 – Human dignity and individual autonomy\nEach Party shall adopt or maintain measures to respect human dignity and individual autonomy\nin relation to activities within the lifecycle of artificial intelligence systems.\nArticle 8 – Transparency and oversight\nEach Party shall adopt or maintain measures to ensure that adequate transparency and\noversight requirements tailored to the specific contexts and risks are in place in respect of\nactivities within the lifecycle of artificial intelligence systems, including with regard to the\nidentification of content generated by artificial intelligence systems.\nArticle 9 – Accountability and responsibility\nEach Party shall adopt or maintain measures to ensure accountability and responsibility for\nadverse impacts on human rights, democracy and the rule of law resulting from activities within\nthe lifecycle of artificial intelligence systems.\nArticle 10 – Equality and non-discrimination\n1 Each Party shall adopt or maintain measures with a view to ensuring that activities within the\nlifecycle of artificial intelligence systems respect equality, including gender equality, and the\nprohibition of discrimination, as provided under applicable international and domestic law.\n2 Each Party undertakes to adopt or maintain measures aimed at overcoming inequalities to\nachieve fair, just and equitable outcomes, in line with its applicable domestic and international\nhuman rights obligations, in relation to activities within the lifecycle of artificial intelligence\nsystems.\nCETS 225 – Artificial Intelligence, 5.IX.2024\n__________________________________________________________________________________\n5\nArticle 11 – Privacy and personal data protection\nEach Party shall adopt or maintain measures to ensure that, with regard to activities within the\nlifecycle of artificial intelligence systems:\na privacy rights of individuals and their personal data are protected, including through\napplicable domestic and international laws, standards and frameworks; and\nb effective guarantees and safeguards have been put in place for individuals, in accordance\nwith applicable domestic and international legal obligations.\nArticle 12 – Reliability\nEach Party shall take, as appropriate, measures to promote the reliability of artificial intelligence\nsystems and trust in their outputs, which could include requirements related to adequate quality\nand security throughout the lifecycle of artificial intelligence systems.\nArticle 13 – Safe innovation\nWith a view to fostering innovation while avoiding adverse impacts on human rights, democracy\nand the rule of law, each Party is called upon to enable, as appropriate, the establishment of\ncontrolled environments for developing, experimenting and testing artificial intelligence systems\nunder the supervision of its competent authorities.\nChapter IV – Remedies\nArticle 14 – Remedies\n1 Each Party shall, to the extent remedies are required by its international obligations and\nconsistent with its domestic legal system, adopt or maintain measures to ensure the availability\nof accessible and effective remedies for violations of human rights resulting from the activities\nwithin the lifecycle of artificial intelligence systems.\n2 With the aim of supporting paragraph 1 above, each Party shall adopt or maintain measures\nincluding:\na measures to ensure that relevant information regarding artificial intelligence systems which\nhave the potential to significantly affect human rights and their relevant usage is\ndocumented, provided to bodies authorised to access that information and, where\nappropriate and applicable, made available or communicated to affected persons;\nb measures to ensure that the information referred to in subparagraph a is sufficient for the\naffected persons to contest the decision(s) made or substantially informed by the use of\nthe system, and, where relevant and appropriate, the use of the system itself; and\nc an effective possibility for persons concerned to lodge a complaint to competent\nauthorities.\nArticle 15 – Procedural safeguards\n1 Each Party shall ensure that, where an artificial intelligence system significantly impacts upon\nthe enjoyment of human rights, effective procedural guarantees, safeguards and rights, in\naccordance with the applicable international and domestic law, are available to persons affected\nthereby.\nCETS 225 – Artificial Intelligence, 5.IX.2024\n__________________________________________________________________________________\n6\n2 Each Party shall seek to ensure that, as appropriate for the context, persons interacting with\nartificial intelligence systems are notified that they are interacting with such systems rather than\nwith a human.\nChapter V – Assessment and mitigation of risks and adverse impacts\nArticle 16 – Risk and impact management framework\n1 Each Party shall, taking into account the principles set forth in Chapter III, adopt or maintain\nmeasures for the identification, assessment, prevention and mitigation of risks posed by artificial\nintelligence systems by considering actual and potential impacts to human rights, democracy\nand the rule of law.\n2 Such measures shall be graduated and differentiated, as appropriate, and:\na take due account of the context and intended use of artificial intelligence systems, in\nparticular as concerns risks to human rights, democracy, and the rule of law;\nb take due account of the severity and probability of potential impacts;\nc consider, where appropriate, the perspectives of relevant stakeholders, in particular\npersons whose rights may be impacted;\nd apply iteratively throughout the activities within the lifecycle of the artificial intelligence\nsystem;\ne include monitoring for risks and adverse impacts to human rights, democracy, and the rule\nof law;\nf include documentation of risks, actual and potential impacts, and the risk management\napproach; and\ng require, where appropriate, testing of artificial intelligence systems before making them\navailable for first use and when they are significantly modified.\n3 Each Party shall adopt or maintain measures that seek to ensure that adverse impacts of\nartificial intelligence systems to human rights, democracy, and the rule of law are adequately\naddressed. Such adverse impacts and measures to address them should be documented and\ninform the relevant risk management measures described in paragraph 2.\n4 Each Party shall assess the need for a moratorium or ban or other appropriate measures in\nrespect of certain uses of artificial intelligence systems where it considers such uses\nincompatible with the respect for human rights, the functioning of democracy or the rule of law.\nChapter VI – Implementation of the Convention\nArticle 17 – Non-discrimination\nThe implementation of the provisions of this Convention by the Parties shall be secured without\ndiscrimination on any ground, in accordance with their international human rights obligations.\nCETS 225 – Artificial Intelligence, 5.IX.2024\n__________________________________________________________________________________\n7\nArticle 18 – Rights of persons with disabilities and of children\nEach Party shall, in accordance with its domestic law and applicable international obligations,\ntake due account of any specific needs and vulnerabilities in relation to respect for the rights of\npersons with disabilities and of children.\nArticle 19 – Public consultation\nEach Party shall seek to ensure that important questions raised in relation to artificial\nintelligence systems are, as appropriate, duly considered through public discussion and\nmultistakeholder consultation in the light of social, economic, legal, ethical, environmental and\nother relevant implications.\nArticle 20 – Digital literacy and skills\nEach Party shall encourage and promote adequate digital literacy and digital skills for all\nsegments of the population, including specific expert skills for those responsible for the\nidentification, assessment, prevention and mitigation of risks posed by artificial intelligence\nsystems.\nArticle 21 – Safeguard for existing human rights\nNothing in this Convention shall be construed as limiting, derogating from or otherwise affecting\nthe human rights or other related legal rights and obligations which may be guaranteed under\nthe relevant laws of a Party or any other relevant international agreement to which it is party.\nArticle 22 – Wider protection\nNone of the provisions of this Convention shall be interpreted as limiting or otherwise affecting\nthe possibility for a Party to grant a wider measure of protection than is stipulated in this\nConvention.\nChapter VII – Follow-up mechanism and co-operation\nArticle 23 – Conference of the Parties\n1 The Conference of the Parties shall be composed of representatives of the Parties to this\nConvention.\n2 The Parties shall consult periodically with a view to:\na facilitating the effective application and implementation of this Convention, including the\nidentification of any problems and the effects of any reservation made in pursuance of\nArticle 34, paragraph 1, or any declaration made under this Convention;\nb considering the possible supplementation to or amendment of this Convention;\nc considering matters and making specific recommendations concerning the interpretation\nand application of this Convention;\nd facilitating the exchange of information on significant legal, policy or technological\ndevelopments of relevance, including in pursuit of the objectives defined in Article 25, for\nthe implementation of this Convention;\ne facilitating, where necessary, the friendly settlement of disputes related to the application\nof this Convention; and\nCETS 225 – Artificial Intelligence, 5.IX.2024\n__________________________________________________________________________________\n8\nf facilitating co-operation with relevant stakeholders concerning pertinent aspects of the\nimplementation of this Convention, including through public hearings where appropriate.\n3 The Conference of the Parties shall be convened by the Secretary General of the Council of\nEurope whenever necessary and, in any case, when a majority of the Parties or the Committee\nof Ministers requests its convocation.\n4 The Conference of the Parties shall adopt its own rules of procedure by consensus within twelve\nmonths of the entry into force of this Convention.\n5 The Parties shall be assisted by the Secretariat of the Council of Europe in carrying out their\nfunctions pursuant to this article.\n6 The Conference of the Parties may propose to the Committee of Ministers appropriate ways to\nengage relevant expertise in support of the effective implementation of this Convention.\n7 Any Party which is not a member of the Council of Europe shall contribute to the funding of the\nactivities of the Conference of the Parties. The contribution of a non-member of the Council of\nEurope shall be established jointly by the Committee of Ministers and that non-member.\n8 The Conference of the Parties may decide to restrict the participation in its work of a Party that\nhas ceased to be a member of the Council of Europe under Article 8 of the Statute of the Council\nof Europe (ETS No. 1) for a serious violation of Article 3 of the Statute. Similarly, measures can\nbe taken in respect of any Party that is not a member State of the Council of Europe by a\ndecision of the Committee of Ministers to cease its relations with that State on grounds similar\nto those mentioned in Article 3 of the Statute.\nArticle 24 – Reporting obligation\n1 Each Party shall provide a report to the Conference of the Parties within the first two years after\nbecoming a Party, and then periodically thereafter with details of the activities undertaken to\ngive effect to Article 3, paragraph 1, sub-paragraphs a and b.\n2 The Conference of the Parties shall determine the format and the process for the report in\naccordance with its rules of procedure.\nArticle 25 – International co-operation\n1 The Parties shall co-operate in the realisation of the purpose of this Convention. Parties are\nfurther encouraged, as appropriate, to assist States that are not Parties to this Convention in\nacting consistently with the terms of this Convention and becoming a Party to it.\n2 The Parties shall, as appropriate, exchange relevant and useful information between\nthemselves concerning aspects related to artificial intelligence which may have significant\npositive or negative effects on the enjoyment of human rights, the functioning of democracy and\nthe observance of the rule of law, including risks and effects that have arisen in research\ncontexts and in relation to the private sector. Parties are encouraged to involve, as appropriate,\nrelevant stakeholders and States that are not Parties to this Convention in such exchanges of\ninformation.\nCETS 225 – Artificial Intelligence, 5.IX.2024\n__________________________________________________________________________________\n9\n3 The Parties are encouraged to strengthen co-operation, including with relevant stakeholders\nwhere appropriate, to prevent and mitigate risks and adverse impacts on human rights,\ndemocracy and the rule of law in the context of activities within the lifecycle of artificial\nintelligence systems.\nArticle 26 – Effective oversight mechanisms\n1 Each Party shall establish or designate one or more effective mechanisms to oversee\ncompliance with the obligations in this Convention.\n2 Each Party shall ensure that such mechanisms exercise their duties independently and\nimpartially and that they have the necessary powers, expertise and resources to effectively fulfil\ntheir tasks of overseeing compliance with the obligations in this Convention, as given effect by\nthe Parties.\n3 If a Party has provided for more than one such mechanism, it shall take measures, where\npracticable, to facilitate effective cooperation among them.\n4 If a Party has provided for mechanisms different from existing human rights structures, it shall\ntake measures, where practicable, to promote effective cooperation between the mechanisms\nreferred to in paragraph 1 and those existing domestic human rights structures.\nChapter VIII – Final clauses\nArticle 27 – Effects of the Convention\n1 If two or more Parties have already concluded an agreement or treaty on the matters dealt with\nin this Convention, or have otherwise established relations on such matters, they shall also be\nentitled to apply that agreement or treaty or to regulate those relations accordingly, so long as\nthey do so in a manner which is not inconsistent with the object and purpose of this Convention.\n2 Parties which are members of the European Union shall, in their mutual relations, apply\nEuropean Union rules governing the matters within the scope of this Convention without\nprejudice to the object and purpose of this Convention and without prejudice to its full\napplication with other Parties. The same applies to other Parties to the extent that they are\nbound by such rules.\nArticle 28 – Amendments\n1 Amendments to this Convention may be proposed by any Party, the Committee of Ministers of\nthe Council of Europe or the Conference of the Parties.\n2 Any proposal for amendment shall be communicated by the Secretary General of the Council\nof Europe to the Parties.\n3 Any amendment proposed by a Party, or the Committee of Ministers, shall be communicated\nto the Conference of the Parties, which shall submit to the Committee of Ministers its opinion\non the proposed amendment.\n4 The Committee of Ministers shall consider the proposed amendment and the opinion submitted\nby the Conference of the Parties and may approve the amendment.\n5 The text of any amendment approved by the Committee of Ministers in accordance with\nparagraph 4 shall be forwarded to the Parties for acceptance.\nCETS 225 – Artificial Intelligence, 5.IX.2024\n__________________________________________________________________________________\n10\n6 Any amendment approved in accordance with paragraph 4 shall come into force on the thirtieth\nday after all Parties have informed the Secretary General of their acceptance thereof.\nArticle 29 – Dispute settlement\nIn the event of a dispute between Parties as to the interpretation or application of this\nConvention, these Parties shall seek a settlement of the dispute through negotiation or any\nother peaceful means of their choice, including through the Conference of the Parties, as\nprovided for in Article 23, paragraph 2, sub-paragraph e.\nArticle 30 – Signature and entry into force\n1 This Convention shall be open for signature by the member States of the Council of Europe,\nthe non-member States which have participated in its elaboration and the European Union.\n2 This Convention is subject to ratification, acceptance or approval. Instruments of ratification,\nacceptance or approval shall be deposited with the Secretary General of the Council of Europe.\n3 This Convention shall enter into force on the first day of the month following the expiration of a\nperiod of three months after the date on which five signatories, including at least three member\nStates of the Council of Europe, have expressed their consent to be bound by this Convention\nin accordance with paragraph 2.\n4 In respect of any signatory which subsequently expresses its consent to be bound by it, this\nConvention shall enter into force on the first day of the month following the expiration of a period\nof three months after the date of the deposit of its instrument of ratification, acceptance or\napproval.\nArticle 31 – Accession\n1 After the entry into force of this Convention, the Committee of Ministers of the Council of Europe\nmay, after consulting the Parties to this Convention and obtaining their unanimous consent,\ninvite any non-member State of the Council of Europe which has not participated in the\nelaboration of this Convention to accede to this Convention by a decision taken by the majority\nprovided for in Article 20.d of the Statute of the Council of Europe, and by unanimous vote of\nthe representatives of the Parties entitled to sit on the Committee of Ministers.\n2 In respect of any acceding State, this Convention shall enter into force on the first day of the\nmonth following the expiration of a period of three months after the date of deposit of the\ninstrument of accession with the Secretary General of the Council of Europe.\nArticle 32 – Territorial application\n1 Any State or the European Union may, at the time of signature or when depositing its instrument\nof ratification, acceptance, approval or accession, specify the territory or territories to which this\nConvention shall apply.\n2 Any Party may, at a later date, by a declaration addressed to the Secretary General of the\nCouncil of Europe, extend the application of this Convention to any other territory specified in\nthe declaration. In respect of such territory, this Convention shall enter into force on the first\nday of the month following the expiration of a period of three months after the date of receipt of\nthe declaration by the Secretary General.\nCETS 225 – Artificial Intelligence, 5.IX.2024\n__________________________________________________________________________________\n11\n3 Any declaration made under the two preceding paragraphs may, in respect of any territory\nspecified in said declaration, be withdrawn by a notification addressed to the Secretary General\nof the Council of Europe. The withdrawal shall become effective on the first day of the month\nfollowing the expiration of a period of three months after the date of receipt of such notification\nby the Secretary General.\nArticle 33 – Federal clause\n1 A federal State may reserve the right to assume obligations under this Convention consistent\nwith its fundamental principles governing the relationship between its central government and\nconstituent states or other similar territorial entities, provided that this Convention shall apply to\nthe central government of the federal State.\n2 With regard to the provisions of this Convention, the application of which comes under the\njurisdiction of constituent states or other similar territorial entities that are not obliged by the\nconstitutional system of the federation to take legislative measures, the federal government\nshall inform the competent authorities of such states of the said provisions with its favourable\nopinion, and encourage them to take appropriate action to give them effect.\nArticle 34 – Reservations\n1 By a written notification addressed to the Secretary General of the Council of Europe, any State\nmay, at the time of signature or when depositing its instrument of ratification, acceptance,\napproval or accession, declare that it avails itself of the reservation provided for in Article 33,\nparagraph 1.\n2 No other reservation may be made in respect of this Convention.\nArticle 35 – Denunciation\n1 Any Party may, at any time, denounce this Convention by means of a notification addressed to\nthe Secretary General of the Council of Europe.\n2 Such denunciation shall become effective on the first day of the month following the expiration\nof a period of three months after the date of receipt of the notification by the Secretary General.\nArticle 36 – Notification\nThe Secretary General of the Council of Europe shall notify the member States of the Council\nof Europe, the non-member States which have participated in the elaboration of this\nConvention, the European Union, any signatory, any contracting State, any Party and any other\nState which has been invited to accede to this Convention, of:\na any signature;\nb the deposit of any instrument of ratification, acceptance, approval or accession;\nc any date of entry into force of this Convention, in accordance with Article 30, paragraphs 3\nand 4, and Article 31, paragraph 2;\nd any amendment adopted in accordance with Article 28 and the date on which such an\namendment enters into force;\ne any declaration made in pursuance of Article 3, paragraph 1, sub-paragraph b;\nf any reservation and withdrawal of a reservation made in pursuance of Article 34;\nCETS 225 – Artificial Intelligence, 5.IX.2024\n__________________________________________________________________________________\n12\ng any denunciation made in pursuance of Article 35;\nh any other act, declaration, notification or communication relating to this Convention.\nIn witness whereof the undersigned, being duly authorised thereto, have signed this\nConvention.\nDone in Vilnius, this 5th day of September 2024, in English and in French, both texts being\nequally authentic, in a single copy which shall be deposited in the archives of the Council of\nEurope. The Secretary General of the Council of Europe shall transmit certified copies to each\nmember State of the Council of Europe, to the non-member States which have participated in\nthe elaboration of this Convention, to the European Union and to any State invited to accede to\nthis Convention.\n\n", "metadata": {"country": "Europe", "year": "2024", "legally_binding": "other", "binding_proof": "Council of Europe", "date": "", "regulator": "Council of Europe Treaty Series, Council of Europe Framework Convention on Artificial Intelligence and Human Rights, Democracy and the Rule of Law", "type": "  ", "status": " ", "language": "EN", "use_cases": "[1,2, 3, 4, 5, 6]"}}
{"_id": "68671c22a2aa5605ccf0f513", "title": "The European Convention on Human Rights", "source": "https://www.echr.coe.int/documents/d/echr/convention_ENG", "text": "European Convention\non Human Rights\nEuropean\nConvention\non Human\nRights\nas amended by Protocols Nos. 11,\n14 and 15\nsupplemented by Protocols Nos. 1, 4,\n6, 7, 12, 13 and 16\n3\nThe text of the Convention is presented as amended by the\nprovisions of Protocol No. 15 (CETS No. 213) as from its\nentry into force on 1 August 2021 and of Protocol No. 14\n(CETS No. 194) as from its entry into force on 1 June 2010.\nThe text of the Convention had previously been amended\naccording to the provisions of Protocol No. 3 (ETS No. 45),\nwhich entered into force on 21 September1970, of\nProtocol No. 5 (ETS No. 55), which entered into force\non 20 December 1971, and of Protocol No. 8 (ETS No. 118),\nwhich entered into force on 1 January 1990, and comprised also\nthe text of Protocol No. 2 (ETS No. 44) which, in accordance with\nArticle 5 paragraph 3 thereof, had been an integral part of the\nConvention since its entry into force on 21 September 1970. All\nprovisions which had been amended or added by these Protocols\nwere replaced by Protocol No. 11 (ETS No. 155), as from the date\nof its entry into force on 1 November 1998. As from that date,\nProtocol No. 9 (ETS No. 140), which entered into force\non 1 October 1994, was repealed and Protocol No. 10\n(ETS No. 146) lost its purpose.\nThe current state of signatures and ratifications of the Convention\nand its Protocols as well as the complete list of declarations and\nreservations are available at www.conventions.coe.int.\nOnly the English and French versions of the Convention are authentic.\nEuropean Court of Human Rights\nCouncil of Europe\n67075 Strasbourg cedex\nFrance\nwww.echr.coe.int\nContents\nConvention for the Protection of Human Rights\nand Fundamental Freedoms ............................................5\nProtocol ......................................................................33\nProtocol No. 4.............................................................36\nProtocol No. 6.............................................................40\nProtocol No. 7.............................................................44\nProtocol No. 12...........................................................50\nProtocol No. 13...........................................................54\nProtocol No. 16...........................................................58\n5\nConvention for the Protection\nof Human Rights\nand Fundamental Freedoms\nRome, 4.XI.1950\nThe Governments signatory hereto, being members of the Council\nof Europe,\nConsidering the Universal Declaration of Human Rights\nproclaimed by the General Assembly of the United Nations on\n10th December 1948;\nConsidering that this Declaration aims at securing the universal\nand effective recognition and observance of the Rights therein\ndeclared;\nConsidering that the aim of the Council of Europe is the achievement\nof greater unity between its members and that one of the methods\nby which that aim is to be pursued is the maintenance and further\nrealisation of Human Rights and Fundamental Freedoms;\nReaffirming their profound belief in those fundamental freedoms\nwhich are the foundation of justice and peace in the world and\nare best maintained on the one hand by an effective political\ndemocracy and on the other by a common understanding and\nobservance of the Human Rights upon which they depend;\nBeing resolved, as the governments of European countries\nwhich are like-minded and have a common heritage of political\ntraditions, ideals, freedom and the rule of law, to take the first\nsteps for the collective enforcement of certain of the rights stated\nin the Universal Declaration,\n6 7\nAffirming that the High Contracting Parties, in accordance with\nthe principle of subsidiarity, have the primary responsibility to\nsecure the rights and freedoms defined in this Convention and\nthe Protocols thereto, and that in doing so they enjoy a margin\nof appreciation, subject to the supervisory jurisdiction of the\nEuropean Court of Human Rights established by this Convention,\nHave agreed as follows:\nARTICLE 1\nObligation to respect Human Rights\nThe High Contracting Parties shall secure to everyone within their\njurisdiction the rights and freedoms defined in Section I of this\nConvention.\nSECTION I\nRIGHTS AND FREEDOMS\nARTICLE 2\nRight to life\n1. Everyone’s right to life shall be protected by law. No one\nshall be deprived of his life intentionally save in the execution of\na sentence of a court following his conviction of a crime for which\nthis penalty is provided by law.\n2. Deprivation of life shall not be regarded as inflicted in\ncontravention of this Article when it results from the use of force\nwhich is no more than absolutely necessary:\n(a) in defence of any person from unlawful violence;\n(b) in order to effect a lawful arrest or to prevent the escape\nof a person lawfully detained;\n(c) in action lawfully taken for the purpose of quelling a riot\nor insurrection.\nARTICLE 3\nProhibition of torture\nNo one shall be subjected to torture or to inhuman or degrading\ntreatment or punishment.\nARTICLE 4\nProhibition of slavery and forced labour\n1. No one shall be held in slavery or servitude.\n2. No one shall be required to perform forced or compulsory\nlabour.\n3. For the purpose of this Article the term “forced or compulsory\nlabour” shall not include:\n(a) any work required to be done in the ordinary course of\ndetention imposed according to the provisions of Article5\nof this Convention or during conditional release from\nsuch detention;\n(b) any service of a military character or, in case of\nconscientious objectors in countries where they are\nrecognised, service exacted instead of compulsory\nmilitary service;\n(c) any service exacted in case of an emergency or calamity\nthreatening the life or well-being of the community;\n(d) any work or service which forms part of normal civic\nobligations.\n8 9\nARTICLE 5\nRight to liberty and security\n1. Everyone has the right to liberty and security of person. No\none shall be deprived of his liberty save in the following cases and\nin accordance with a procedure prescribed by law:\n(a) the lawful detention of a person after conviction by a\ncompetent court;\n(b) the lawful arrest or detention of a person for noncompliance with the lawful order of a court or in order to\nsecure the fulfilment of any obligation prescribed by law;\n(c) the lawful arrest or detention of a person effected for\nthe purpose of bringing him before the competent legal\nauthority on reasonable suspicion of having committed\nan offence or when it is reasonably considered necessary\nto prevent his committing an offence or fleeing after\nhaving done so;\n(d) the detention of a minor by lawful order for the purpose\nof educational supervision or his lawful detention for\nthe purpose of bringing him before the competent legal\nauthority;\n(e) the lawful detention of persons for the prevention of the\nspreading of infectious diseases, of persons of unsound\nmind, alcoholics or drug addicts or vagrants;\n(f) the lawful arrest or detention of a person to prevent his\neffecting an unauthorised entry into the country or of a\nperson against whom action is being taken with a view\nto deportation or extradition.\n2. Everyone who is arrested shall be informed promptly, in a\nlanguage which he understands, of the reasons for his arrest and\nof any charge against him.\n3. Everyone arrested or detained in accordance with the\nprovisions of paragraph 1 (c) of this Article shall be brought\npromptly before a judge or other officer authorised by law to\nexercise judicial power and shall be entitled to trial within a\nreasonable time or to release pending trial. Release may be\nconditioned by guarantees to appear for trial.\n4. Everyone who is deprived of his liberty by arrest or detention\nshall be entitled to take proceedings by which the lawfulness of\nhis detention shall be decided speedily by a court and his release\nordered if the detention is not lawful.\n5. Everyone who has been the victim of arrest or detention\nin contravention of the provisions of this Article shall have an\nenforceable right to compensation.\nARTICLE 6\nRight to a fair trial\n1. In the determination of his civil rights and obligations or of\nany criminal charge against him, everyone is entitled to a fair\nand public hearing within a reasonable time by an independent\nand impartial tribunal established by law. Judgment shall be\npronounced publicly but the press and public may be excluded\nfrom all or part of the trial in the interests of morals, public order\nor national security in a democratic society, where the interests\nof juveniles or the protection of the private life of the parties so\nrequire, or to the extent strictly necessary in the opinion of the\ncourt in special circumstances where publicity would prejudice the\ninterests of justice.\n2. Everyone charged with a criminal offence shall be presumed\ninnocent until proved guilty according to law.\n10 11\n3. Everyone charged with a criminal offence has the following\nminimum rights:\n(a) to be informed promptly, in a language which he\nunderstands and in detail, of the nature and cause of the\naccusation against him;\n(b) to have adequate time and facilities for the preparation of\nhis defence;\n(c) to defend himself in person or through legal assistance of\nhis own choosing or, if he has not sufficient means to pay\nfor legal assistance, to be given it free when the interests\nof justice so require;\n(d) to examine or have examined witnesses against him and\nto obtain the attendance and examination of witnesses on\nhis behalf under the same conditions as witnesses against\nhim;\n(e) to have the free assistance of an interpreter if he cannot\nunderstand or speak the language used in court.\nARTICLE 7\nNo punishment without law\n1. No one shall be held guilty of any criminal offence on\naccount of any act or omission which did not constitute a criminal\noffence under national or international law at the time when it\nwas committed. Nor shall a heavier penalty be imposed than\nthe one that was applicable at the time the criminal offence was\ncommitted.\n2. This Article shall not prejudice the trial and punishment of\nany person for any act or omission which, at the time when it was\ncommitted, was criminal according to the general principles of\nlaw recognised by civilised nations.\nARTICLE 8\nRight to respect for private and family life\n1. Everyone has the right to respect for his private and family\nlife, his home and his correspondence.\n2. There shall be no interference by a public authority with the\nexercise of this right except such as is in accordance with the\nlaw and is necessary in a democratic society in the interests of\nnational security, public safety or the economic well-being of the\ncountry, for the prevention of disorder or crime, for the protection\nof health or morals, or for the protection of the rights and freedoms\nof others.\nARTICLE 9\nFreedom of thought, conscience and religion\n1. Everyone has the right to freedom of thought, conscience\nand religion; this right includes freedom to change his religion or\nbelief and freedom, either alone or in community with others and\nin public or private, to manifest his religion or belief, in worship,\nteaching, practice and observance.\n2. Freedom to manifest one’s religion or beliefs shall be\nsubject only to such limitations as are prescribed by law and are\nnecessary in a democratic society in the interests of public safety,\nfor the protection of public order, health or morals, or for the\nprotection of the rights and freedoms of others.\n12 13\nARTICLE 10\nFreedom of expression\n1. Everyone has the right to freedom of expression. This right\nshall include freedom to hold opinions and to receive and impart\ninformation and ideas without interference by public authority\nand regardless of frontiers. This Article shall not prevent States\nfrom requiring the licensing of broadcasting, television or cinema\nenterprises.\n2. The exercise of these freedoms, since it carries with it\nduties and responsibilities, may be subject to such formalities,\nconditions, restrictions or penalties as are prescribed by law and\nare necessary in a democratic society, in the interests of national\nsecurity, territorial integrity or public safety, for the prevention\nof disorder or crime, for the protection of health or morals, for\nthe protection of the reputation or rights of others, for preventing\nthe disclosure of information received in confidence, or for\nmaintaining the authority and impartiality of the judiciary.\nARTICLE 11\nFreedom of assembly and association\n1. Everyone has the right to freedom of peaceful assembly and\nto freedom of association with others, including the right to form\nand to join trade unions for the protection of his interests.\n2. No restrictions shall be placed on the exercise of these rights\nother than such as are prescribed by law and are necessary in\na democratic society in the interests of national security or public\nsafety, for the prevention of disorder or crime, for the protection\nof health or morals or for the protection of the rights and freedoms\nof others. This Article shall not prevent the imposition of lawful\nrestrictions on the exercise of these rights by members of the\narmed forces, of the police or of the administration of the State.\nARTICLE 12\nRight to marry\nMen and women of marriageable age have the right to marry and\nto found a family, according to the national laws governing the\nexercise of this right.\nARTICLE 13\nRight to an effective remedy\nEveryone whose rights and freedoms as set forth in this Convention\nare violated shall have an effective remedy before a national\nauthority notwithstanding that the violation has been committed\nby persons acting in an official capacity.\nARTICLE 14\nProhibition of discrimination\nThe enjoyment of the rights and freedoms set forth in this\nConvention shall be secured without discrimination on any ground\nsuch as sex, race, colour, language, religion, political or other\nopinion, national or social origin, association with a national\nminority, property, birth or other status.\nARTICLE 15\nDerogation in time of emergency\n1. In time of war or other public emergency threatening the\nlife of the nation any High Contracting Party may take measures\nderogating from its obligations under this Convention to the extent\nstrictly required by the exigencies of the situation, provided that\nsuch measures are not inconsistent with its other obligations under\ninternational law.\n14 15\n2. No derogation from Article 2, except in respect of\ndeaths resulting from lawful acts of war, or from Articles 3, 4\n(paragraph 1) and 7 shall be made under this provision.\n3. Any High Contracting Party availing itself of this right of\nderogation shall keep the Secretary General of the Council of\nEurope fully informed of the measures which it has taken and\nthe reasons therefor. It shall also inform the Secretary General\nof the Council of Europe when such measures have ceased to\noperate and the provisions of the Convention are again being\nfully executed.\nARTICLE 16\nRestrictions on political activity of aliens\nNothing in Articles 10, 11 and 14 shall be regarded as preventing\nthe High Contracting Parties from imposing restrictions on the\npolitical activity of aliens.\nARTICLE 17\nProhibition of abuse of rights\nNothing in this Convention may be interpreted as implying for\nany State, group or person any right to engage in any activity or\nperform any act aimed at the destruction of any of the rights and\nfreedoms set forth herein or at their limitation to a greater extent\nthan is provided for in the Convention.\nARTICLE 18\nLimitation on use of restrictions on rights\nThe restrictions permitted under this Convention to the said rights\nand freedoms shall not be applied for any purpose other than\nthose for which they have been prescribed.\nSECTION II\nEUROPEAN COURT OF HUMAN RIGHTS\nARTICLE 19\nEstablishment of the Court\nTo ensure the observance of the engagements undertaken by\nthe High Contracting Parties in the Convention and the Protocols\nthereto, there shall be set up a European Court of Human Rights,\nhereinafter referred to as “the Court”. It shall function on a\npermanent basis.\nARTICLE 20\nNumber of judges\nThe Court shall consist of a number of judges equal to that of the\nHigh Contracting Parties.\nARTICLE 21\nCriteria for office\n1. The judges shall be of high moral character and must either\npossess the qualifications required for appointment to high judicial\noffice or be jurisconsults of recognised competence.\n2. Candidates shall be less than 65 years of age at the date\nby which the list of three candidates has been requested by the\nParliamentary Assembly, further to Article 22.\n3. The judges shall sit on the Court in their individual capacity.\n4. During their term of office the judges shall not engage in\nany activity which is incompatible with their independence,\nimpartiality or with the demands of a full-time office; all questions\narising from the application of this paragraph shall be decided by\nthe Court.\n16 17\nARTICLE 22\nElection of judges\nThe judges shall be elected by the Parliamentary Assembly with\nrespect to each High Contracting Party by a majority of votes cast\nfrom a list of three candidates nominated by the High Contracting\nParty.\nARTICLE 23\nTerms of office and dismissal\n1. The judges shall be elected for a period of nine years. They\nmay not be re-elected.\n2. The judges shall hold office until replaced. They shall,\nhowever, continue to deal with such cases as they already have\nunder consideration.\n3. No judge may be dismissed from office unless the other\njudges decide by a majority of two-thirds that that judge has\nceased to fulfil the required conditions.\nARTICLE 24\nRegistry and rapporteurs\n1. The Court shall have a Registry, the functions and organisation\nof which shall be laid down in the rules of the Court.\n2. When sitting in a single-judge formation, the Court shall be\nassisted by rapporteurs who shall function under the authority\nof the President of the Court. They shall form part of the Court’s\nRegistry.\nARTICLE 25\nPlenary Court\nThe plenary Court shall\n(a) elect its President and one or two Vice-Presidents for a\nperiod of three years; they may be re-elected;\n(b) set up Chambers, constituted for a fixed period of time;\n(c) elect the Presidents of the Chambers of the Court; they\nmay be re-elected;\n(d) adopt the rules of the Court;\n(e) elect the Registrar and one or more Deputy Registrars;\n(f) make any request under Article 26, paragraph 2.\nARTICLE 26\nSingle-judge formation, Committees, Chambers\nand Grand Chamber\n1. To consider cases brought before it, the Court shall sit in\na single-judge formation, in committees of three judges, in\nChambers of seven judges and in a Grand Chamber of seventeen\njudges. The Court’s Chambers shall set up committees for a fixed\nperiod of time.\n2. At the request of the plenary Court, the Committee of Ministers\nmay, by a unanimous decision and for a fixed period, reduce to\nfive the number of judges of the Chambers.\n3. When sitting as a single judge, a judge shall not examine\nany application against the High Contracting Party in respect of\nwhich that judge has been elected.\n18 19\n4. There shall sit as an ex officio member of the Chamber and\nthe Grand Chamber the judge elected in respect of the High\nContracting Party concerned. If there is none or if that judge is\nunable to sit, a person chosen by the President of the Court from\na list submitted in advance by that Party shall sit in the capacity of\njudge.\n5. The Grand Chamber shall also include the President of the\nCourt, the Vice-Presidents, the Presidents of the Chambers and\nother judges chosen in accordance with the rules of the Court.\nWhen a case is referred to the Grand Chamber under Article 43,\nno judge from the Chamber which rendered the judgment shall\nsit in the Grand Chamber, with the exception of the President\nof the Chamber and the judge who sat in respect of the High\nContracting Party concerned.\nARTICLE 27\nCompetence of single judges\n1. A single judge may declare inadmissible or strike out of the\nCourt’s list of cases an application submitted under Article 34,\nwhere such a decision can be taken without further examination.\n2. The decision shall be final.\n3. If the single judge does not declare an application inadmissible\nor strike it out, that judge shall forward it to a committee or to a\nChamber for further examination.\nARTICLE 28\nCompetence of Committees\n1. In respect of an application submitted under Article 34, a\ncommittee may, by a unanimous vote,\n(a) declare it inadmissible or strike it out of its list of cases,\nwhere such decision can be taken without further\nexamination; or\n(b) declare it admissible and render at the same time a\njudgment on the merits, if the underlying question in the\ncase, concerning the interpretation or the application of\nthe Convention or the Protocols thereto, is already the\nsubject of well-established case-law of the Court.\n2. Decisions and judgments under paragraph 1 shall be final.\n3. If the judge elected in respect of the High Contracting Party\nconcerned is not a member of the committee, the committee may\nat any stage of the proceedings invite that judge to take the place\nof one of the members of the committee, having regard to all\nrelevant factors, including whether that Party has contested the\napplication of the procedure under paragraph 1.(b).\nARTICLE 29\nDecisions by Chambers on admissibility and merits\n1. If no decision is taken under Article 27 or 28, or no judgment\nrendered under Article 28, a Chamber shall decide on the\nadmissibility and merits of individual applications submitted under\nArticle 34. The decision on admissibility may be taken separately.\n2. A Chamber shall decide on the admissibility and merits of\ninter-State applications submitted under Article 33. The decision\non admissibility shall be taken separately unless the Court, in\nexceptional cases, decides otherwise.\n20 21\nARTICLE 30\nRelinquishment of jurisdiction to the Grand Chamber\nWhere a case pending before a Chamber raises a serious\nquestion affecting the interpretation of the Convention or the\nProtocols thereto, or where the resolution of a question before\nthe Chamber might have a result inconsistent with a judgment\npreviously delivered by the Court, the Chamber may, at any\ntime before it has rendered its judgment, relinquish jurisdiction in\nfavour of the Grand Chamber.\nARTICLE 31\nPowers of the Grand Chamber\nThe Grand Chamber shall\n(a) determine applications submitted either under Article 33 or\nArticle 34 when a Chamber has relinquished jurisdiction\nunder Article 30 or when the case has been referred to it\nunder Article 43;\n(b) decide on issues referred to the Court by the Committee\nof Ministers in accordance with Article 46, paragraph 4;\nand\n(c) consider requests for advisory opinions submitted under\nArticle 47.\nARTICLE 32\nJurisdiction of the Court\n1. The jurisdiction of the Court shall extend to all matters\nconcerning the interpretation and application of the Convention\nand the Protocols thereto which are referred to it as provided in\nArticles 33, 34, 46 and 47.\n2. In the event of dispute as to whether the Court has jurisdiction,\nthe Court shall decide.\nARTICLE 33\nInter-State cases\nAny High Contracting Party may refer to the Court any alleged\nbreach of the provisions of the Convention and the Protocols\nthereto by another High Contracting Party.\nARTICLE 34\nIndividual applications\nThe Court may receive applications from any person, nongovernmental organisation or group of individuals claiming to be\nthe victim of a violation by one of the High Contracting Parties of\nthe rights set forth in the Convention or the Protocols thereto. The\nHigh Contracting Parties undertake not to hinder in any way the\neffective exercise of this right.\nARTICLE 35\nAdmissibility criteria\n1. The Court may only deal with the matter after all domestic\nremedies have been exhausted, according to the generally\nrecognised rules of international law, and within a period of four\nmonths from the date on which the final decision was taken.\n2. The Court shall not deal with any application submitted under\nArticle 34 that\n(a) is anonymous; or\n(b) is substantially the same as a matter that has already been\nexamined by the Court or has already been submitted\nto another procedure of international investigation or\nsettlement and contains no relevant new information.\n22 23\n3. The Court shall declare inadmissible any individual\napplication submitted under Article 34 if it considers that:\n(a) the application is incompatible with the provisions of the\nConvention or the Protocols thereto, manifestly ill-founded,\nor an abuse of the right of individual application; or\n(b) the applicant has not suffered a significant disadvantage,\nunless respect for human rights as defined in the\nConvention and the Protocols thereto requires an\nexamination of the application on the merits.\n4. The Court shall reject any application which it considers\ninadmissible under this Article. It may do so at any stage of the\nproceedings.\nARTICLE 36\nThird party intervention\n1. In all cases before a Chamber or the Grand Chamber, a\nHigh Contracting Party one of whose nationals is an applicant\nshall have the right to submit written comments and to take part in\nhearings.\n2. The President of the Court may, in the interest of the proper\nadministration of justice, invite any High Contracting Party which\nis not a party to the proceedings or any person concerned who\nis not the applicant to submit written comments or take part in\nhearings.\n3. In all cases before a Chamber or the Grand Chamber, the\nCouncil of Europe Commissioner for Human Rights may submit\nwritten comments and take part in hearings.\nARTICLE 37\nStriking out applications\n1. The Court may at any stage of the proceedings decide to\nstrike an application out of its list of cases where the circumstances\nlead to the conclusion that\n(a) the applicant does not intend to pursue his application; or\n(b) the matter has been resolved; or\n(c) for any other reason established by the Court, it is no\nlonger justified to continue the examination of the\napplication.\nHowever, the Court shall continue the examination of the\napplication if respect for human rights as defined in the Convention\nand the Protocols thereto so requires.\n2. The Court may decide to restore an application to its list of\ncases if it considers that the circumstances justify such a course.\nARTICLE 38\nExamination of the case\nThe Court shall examine the case together with the representatives\nof the parties and, if need be, undertake an investigation, for the\neffective conduct of which the High Contracting Parties concerned\nshall furnish all necessary facilities.\nARTICLE 39\nFriendly settlements\n1. At any stage of the proceedings, the Court may place itself\nat the disposal of the parties concerned with a view to securing a\nfriendly settlement of the matter on the basis of respect for human\nrights as defined in the Convention and the Protocols thereto.\n24 25\n2. Proceedings conducted under paragraph 1 shall be\nconfidential.\n3. If a friendly settlement is effected, the Court shall strike the\ncase out of its list by means of a decision which shall be confined\nto a brief statement of the facts and of the solution reached.\n4. This decision shall be transmitted to the Committee of\nMinisters, which shall supervise the execution of the terms of the\nfriendly settlement as set out in the decision.\nARTICLE 40\nPublic hearings and access to documents\n1. Hearings shall be in public unless the Court in exceptional\ncircumstances decides otherwise.\n2. Documents deposited with the Registrar shall be accessible to\nthe public unless the President of the Court decides otherwise.\nARTICLE 41\nJust satisfaction\nIf the Court finds that there has been a violation of the Convention\nor the Protocols thereto, and if the internal law of the High\nContracting Party concerned allows only partial reparation to be\nmade, the Court shall, if necessary, afford just satisfaction to the\ninjured party.\nARTICLE 42\nJudgments of Chambers\nJudgments of Chambers shall become final in accordance with the\nprovisions of Article 44, paragraph 2.\nARTICLE 43\nReferral to the Grand Chamber\n1. Within a period of three months from the date of the judgment\nof the Chamber, any party to the case may, in exceptional cases,\nrequest that the case be referred to the Grand Chamber.\n2. A panel of five judges of the Grand Chamber shall accept\nthe request if the case raises a serious question affecting the\ninterpretation or application of the Convention or the Protocols\nthereto, or a serious issue of general importance.\n3. If the panel accepts the request, the Grand Chamber shall\ndecide the case by means of a judgment.\nARTICLE 44\nFinal judgments\n1. The judgment of the Grand Chamber shall be final.\n2. The judgment of a Chamber shall become final\n(a) when the parties declare that they will not request that the\ncase be referred to the Grand Chamber; or\n(b) three months after the date of the judgment, if reference of\nthe case to the Grand Chamber has not been requested;\nor\n(c) when the panel of the Grand Chamber rejects the request\nto refer under Article 43.\n3. The final judgment shall be published.\n26 27\nARTICLE 45\nReasons for judgments and decisions\n1. Reasons shall be given for judgments as well as for decisions\ndeclaring applications admissible or inadmissible.\n2. If a judgment does not represent, in whole or in part, the\nunanimous opinion of the judges, any judge shall be entitled to\ndeliver a separate opinion.\nARTICLE 46\nBinding force and execution of judgments\n1. The High Contracting Parties undertake to abide by the final\njudgment of the Court in any case to which they are parties.\n2. The final judgment of the Court shall be transmitted to the\nCommittee of Ministers, which shall supervise its execution.\n3. If the Committee of Ministers considers that the supervision\nof the execution of a final judgment is hindered by a problem of\ninterpretation of the judgment, it may refer the matter to the Court\nfor a ruling on the question of interpretation. A referral decision\nshall require a majority vote of two-thirds of the representatives\nentitled to sit on the committee.\n4. If the Committee of Ministers considers that a High\nContracting Party refuses to abide by a final judgment in a case to\nwhich it is a party, it may, after serving formal notice on that Party\nand by decision adopted by a majority vote of two-thirds of the\nrepresentatives entitled to sit on the committee, refer to the Court\nthe question whether that Party has failed to fulfil its obligation\nunder paragraph1.\n5. If the Court finds a violation of paragraph 1, it shall\nrefer the case to the Committee of Ministers for consideration\nof the measures to be taken. If the Court finds no violation of\nparagraph1, it shall refer the case to the Committee of Ministers,\nwhich shall close its examination of the case.\nARTICLE 47\nAdvisory opinions\n1. The Court may, at the request of the Committee of Ministers,\ngive advisory opinions on legal questions concerning the\ninterpretation of the Convention and the Protocols thereto.\n2. Such opinions shall not deal with any question relating to\nthe content or scope of the rights or freedoms defined in Section I\nof the Convention and the Protocols thereto, or with any other\nquestion which the Court or the Committee of Ministers might have\nto consider in consequence of any such proceedings as could be\ninstituted in accordance with the Convention.\n3. Decisions of the Committee of Ministers to request an\nadvisory opinion of the Court shall require a majority vote of the\nrepresentatives entitled to sit on the committee.\nARTICLE 48\nAdvisory jurisdiction of the Court\nThe Court shall decide whether a request for an advisory opinion\nsubmitted by the Committee of Ministers is within its competence\nas defined in Article 47.\n28 29\nARTICLE 49\nReasons for advisory opinions\n1. Reasons shall be given for advisory opinions of the Court.\n2. If the advisory opinion does not represent, in whole or in\npart, the unanimous opinion of the judges, any judge shall be\nentitled to deliver a separate opinion.\n3. Advisory opinions of the Court shall be communicated to the\nCommittee of Ministers.\nARTICLE 50\nExpenditure on the Court\nThe expenditure on the Court shall be borne by the Council of\nEurope.\nARTICLE 51\nPrivileges and immunities of judges\nThe judges shall be entitled, during the exercise of their functions,\nto the privileges and immunities provided for in Article 40 of the\nStatute of the Council of Europe and in the agreements made\nthereunder.\nSECTION III\nMISCELLANEOUS PROVISIONS\nARTICLE 52\nInquiries by the Secretary General\nOn receipt of a request from the Secretary General of the Council\nof Europe any High Contracting Party shall furnish an explanation\nof the manner in which its internal law ensures the effective\nimplementation of any of the provisions of the Convention.\nARTICLE 53\nSafeguard for existing human rights\nNothing in this Convention shall be construed as limiting or\nderogating from any of the human rights and fundamental\nfreedoms which may be ensured under the laws of any High\nContracting Party or under any other agreement to which it is a\nparty.\nARTICLE 54\nPowers of the Committee of Ministers\nNothing in this Convention shall prejudice the powers conferred\non the Committee of Ministers by the Statute of the Council of\nEurope.\nARTICLE 55\nExclusion of other means of dispute settlement\nThe High Contracting Parties agree that, except by special\nagreement, they will not avail themselves of treaties, conventions or\ndeclarations in force between them for the purpose of submitting,\nby way of petition, a dispute arising out of the interpretation or\napplication of this Convention to a means of settlement other than\nthose provided for in this Convention.\n30 31\nARTICLE 56\nTerritorial application\n1. Any State may at the time of its ratification or at any time\nthereafter declare by notification addressed to the Secretary\nGeneral of the Council of Europe that the present Convention\nshall, subject to paragraph 4 of this Article, extend to all or any of\nthe territories for whose international relations it is responsible.\n2. The Convention shall extend to the territory or territories\nnamed in the notification as from the thirtieth day after the receipt\nof this notification by the Secretary General of the Council of\nEurope.\n3. The provisions of this Convention shall be applied in such\nterritories with due regard, however, to local requirements.\n4. Any State which has made a declaration in accordance with\nparagraph 1 of this Article may at any time thereafter declare on\nbehalf of one or more of the territories to which the declaration\nrelates that it accepts the competence of the Court to receive\napplications from individuals, non-governmental organisations or\ngroups of individuals as provided by Article 34 of the Convention.\nARTICLE 57\nReservations\n1. Any State may, when signing this Convention or when\ndepositing its instrument of ratification, make a reservation in\nrespect of any particular provision of the Convention to the extent\nthat any law then in force in its territory is not in conformity with\nthe provision. Reservations of a general character shall not be\npermitted under this Article.\n2. Any reservation made under this Article shall contain a brief\nstatement of the law concerned.\nARTICLE 58\nDenunciation\n1. A High Contracting Party may denounce the present\nConvention only after the expiry of five years from the date on\nwhich it became a party to it and after six months’ notice contained\nin a notification addressed to the Secretary General of the Council\nof Europe, who shall inform the other High Contracting Parties.\n2. Such a denunciation shall not have the effect of releasing\nthe High Contracting Party concerned from its obligations under\nthis Convention in respect of any act which, being capable\nof constituting a violation of such obligations, may have been\nperformed by it before the date at which the denunciation became\neffective.\n3. Any High Contracting Party which shall cease to be a\nmember of the Council of Europe shall cease to be a Party to this\nConvention under the same conditions.\n4. The Convention may be denounced in accordance with\nthe provisions of the preceding paragraphs in respect of any\nterritory to which it has been declared to extend under the terms\nof Article56.\nARTICLE 59\nSignature and ratification\n1. This Convention shall be open to the signature of the members\nof the Council of Europe. It shall be ratified. Ratifications shall be\ndeposited with the Secretary General of the Council of Europe.\n2. The European Union may accede to this Convention.\n32 33\n3. The present Convention shall come into force after the deposit\nof ten instruments of ratification.\n4. As regards any signatory ratifying subsequently, the\nConvention shall come into force at the date of the deposit of its\ninstrument of ratification.\n5. The Secretary General of the Council of Europe shall notify all\nthe members of the Council of Europe of the entry into force of the\nConvention, the names of the High Contracting Parties who have\nratified it, and the deposit of all instruments of ratification which\nmay be effected subsequently.\nDone at Rome this 4th day of November 1950, in English and\nFrench, both texts being equally authentic, in a single copy which\nshall remain deposited in the archives of the Council of Europe.\nThe Secretary General shall transmit certified copies to each of\nthe signatories.\nProtocol\nto the Convention\nfor the Protection of Human Rights\nand Fundamental Freedoms\nParis, 20.III.1952\nThe Governments signatory hereto, being members of the Council\nof Europe,\nBeing resolved to take steps to ensure the collective enforcement\nof certain rights and freedoms other than those already included\nin Section I of the Convention for the Protection of Human Rights\nand Fundamental Freedoms signed at Rome on 4 November1950\n(hereinafter referred to as “the Convention”),\nHave agreed as follows:\nARTICLE 1\nProtection of property\nEvery natural or legal person is entitled to the peaceful enjoyment\nof his possessions. No one shall be deprived of his possessions\nexcept in the public interest and subject to the conditions provided\nfor by law and by the general principles of international law.\nThe preceding provisions shall not, however, in any way impair\nthe right of a State to enforce such laws as it deems necessary\nto control the use of property in accordance with the general\ninterest or to secure the payment of taxes or other contributions\nor penalties.\n34 35\nARTICLE 2\nRight to education\nNo person shall be denied the right to education. In the exercise\nof any functions which it assumes in relation to education and to\nteaching, the State shall respect the right of parents to ensure such\neducation and teaching in conformity with their own religious and\nphilosophical convictions.\nARTICLE 3\nRight to free elections\nThe High Contracting Parties undertake to hold free elections at\nreasonable intervals by secret ballot, under conditions which will\nensure the free expression of the opinion of the people in the\nchoice of the legislature.\nARTICLE 4\nTerritorial application\nAny High Contracting Party may at the time of signature or\nratification or at any time thereafter communicate to the Secretary\nGeneral of the Council of Europe a declaration stating the extent\nto which it undertakes that the provisions of the present Protocol\nshall apply to such of the territories for the international relations\nof which it is responsible as are named therein.\nAny High Contracting Party which has communicated a\ndeclaration in virtue of the preceding paragraph may from time to\ntime communicate a further declaration modifying the terms of any\nformer declaration or terminating the application of the provisions\nof this Protocol in respect of any territory.\nA declaration made in accordance with this Article shall be\ndeemed to have been made in accordance with paragraph 1 of\nArticle 56 of the Convention.\nARTICLE 5\nRelationship to the Convention\nAs between the High Contracting Parties the provisions of\nArticles 1, 2, 3 and 4 of this Protocol shall be regarded as\nadditional Articles to the Convention and all the provisions of the\nConvention shall apply accordingly.\nARTICLE 6\nSignature and ratification\nThis Protocol shall be open for signature by the members of the\nCouncil of Europe, who are the signatories of the Convention;\nit shall be ratified at the same time as or after the ratification\nof the Convention. It shall enter into force after the deposit of\nten instruments of ratification. As regards any signatory ratifying\nsubsequently, the Protocol shall enter into force at the date of the\ndeposit of its instrument of ratification.\nThe instruments of ratification shall be deposited with the Secretary\nGeneral of the Council of Europe, who will notify all members of\nthe names of those who have ratified.\nDone at Paris on the 20th day of March 1952, in English and\nFrench, both texts being equally authentic, in a single copy which\nshall remain deposited in the archives of the Council of Europe.\nThe Secretary General shall transmit certified copies to each of the\nsignatory governments.\n36 37\nProtocol No. 4\nto the Convention\nfor the Protection of Human Rights\nand Fundamental Freedoms\nsecuring certain rights and freedoms\nother than those already included\nin the Convention\nand in the First Protocol thereto\nStrasbourg, 16.IX.1963\nThe Governments signatory hereto, being members of the Council\nof Europe,\nBeing resolved to take steps to ensure the collective enforcement of\ncertain rights and freedoms other than those already included in\nSection I of the Convention for the Protection of Human Rights and\nFundamental Freedoms signed at Rome on 4th November1950\n(hereinafter referred to as the “Convention”) and in Articles 1\nto 3 of the First Protocol to the Convention, signed at Paris\non 20th March 1952,\nHave agreed as follows:\nARTICLE 1\nProhibition of imprisonment for debt\nNo one shall be deprived of his liberty merely on the ground of\ninability to fulfil a contractual obligation.\nARTICLE 2\nFreedom of movement\n1. Everyone lawfully within the territory of a State shall, within\nthat territory, have the right to liberty of movement and freedom to\nchoose his residence.\n2. Everyone shall be free to leave any country, including his\nown.\n3. No restrictions shall be placed on the exercise of these rights\nother than such as are in accordance with law and are necessary\nin a democratic society in the interests of national security or public\nsafety, for the maintenance of ordre public, for the prevention of\ncrime, for the protection of health or morals, or for the protection\nof the rights and freedoms of others.\n4. The rights set forth in paragraph 1 may also be subject, in\nparticular areas, to restrictions imposed in accordance with law\nand justified by the public interest in a democratic society.\nARTICLE 3\nProhibition of expulsion of nationals\n1. No one shall be expelled, by means either of an individual\nor of a collective measure, from the territory of the State of which\nhe is a national.\n2. No one shall be deprived of the right to enter the territory of\nthe State of which he is a national.\nARTICLE 4\nProhibition of collective expulsion of aliens\nCollective expulsion of aliens is prohibited.\n38 39\nARTICLE 5\nTerritorial application\n1. Any High Contracting Party may, at the time of signature or\nratification of this Protocol, or at any time thereafter, communicate\nto the Secretary General of the Council of Europe a declaration\nstating the extent to which it undertakes that the provisions of this\nProtocol shall apply to such of the territories for the international\nrelations of which it is responsible as are named therein.\n2. Any High Contracting Party which has communicated a\ndeclaration in virtue of the preceding paragraph may, from time\nto time, communicate a further declaration modifying the terms\nof any former declaration or terminating the application of the\nprovisions of this Protocol in respect of any territory.\n3. A declaration made in accordance with this Article shall be\ndeemed to have been made in accordance with paragraph 1 of\nArticle 56 of the Convention.\n4. The territory of any State to which this Protocol applies by\nvirtue of ratification or acceptance by that State, and each territory\nto which this Protocol is applied by virtue of a declaration by that\nState under this Article, shall be treated as separate territories for\nthe purpose of the references in Articles 2 and 3 to the territory of\na State.\n5. Any State which has made a declaration in accordance with\nparagraph 1 or 2 of this Article may at any time thereafter declare\non behalf of one or more of the territories to which the declaration\nrelates that it accepts the competence of the Court to receive\napplications from individuals, non-governmental organisations or\ngroups of individuals as provided in Article 34 of the Convention\nin respect of all or any of Articles 1 to 4 of this Protocol.\nARTICLE 6\nRelationship to the Convention\nAs between the High Contracting Parties the provisions of\nArticles 1 to 5 of this Protocol shall be regarded as additional\nArticles to the Convention, and all the provisions of the Convention\nshall apply accordingly.\nARTICLE 7\nSignature and ratification\n1. This Protocol shall be open for signature by the members of\nthe Council of Europe who are the signatories of the Convention;\nit shall be ratified at the same time as or after the ratification\nof the Convention. It shall enter into force after the deposit of\nfive instruments of ratification. As regards any signatory ratifying\nsubsequently, the Protocol shall enter into force at the date of the\ndeposit of its instrument of ratification.\n2. The instruments of ratification shall be deposited with the\nSecretary General of the Council of Europe, who will notify all\nmembers of the names of those who have ratified.\nIn witness whereof the undersigned, being duly authorised thereto,\nhave signed this Protocol.\nDone at Strasbourg, this 16th day of September 1963, in English\nand in French, both texts being equally authoritative, in a single\ncopy which shall remain deposited in the archives of the Council\nof Europe. The Secretary General shall transmit certified copies to\neach of the signatory States.\n40 41\nProtocol No. 6\nto the Convention\nfor the Protection of Human Rights\nand Fundamental Freedoms\nconcerning the Abolition\nof the Death Penalty\nStrasbourg, 28.IV.1983\nThe member States of the Council of Europe, signatory to\nthis Protocol to the Convention for the Protection of Human\nRights and Fundamental Freedoms, signed at Rome\non 4 November 1950 (hereinafter referred to as “the Convention”),\nConsidering that the evolution that has occurred in several member\nStates of the Council of Europe expresses a general tendency in\nfavour of abolition of the death penalty;\nHave agreed as follows:\nARTICLE 1\nAbolition of the death penalty\nThe death penalty shall be abolished. No one shall be condemned\nto such penalty or executed.\nARTICLE 2\nDeath penalty in time of war\nA State may make provision in its law for the death penalty in\nrespect of acts committed in time of war or of imminent threat of\nwar; such penalty shall be applied only in the instances laid down\nin the law and in accordance with its provisions. The State shall\ncommunicate to the Secretary General of the Council of Europe\nthe relevant provisions of that law.\nARTICLE 3\nProhibition of derogations\nNo derogation from the provisions of this Protocol shall be made\nunder Article 15 of the Convention.\nARTICLE 4\nProhibition of reservations\nNo reservation may be made under Article 57 of the Convention\nin respect of the provisions of this Protocol.\nARTICLE 5\nTerritorial application\n1. Any State may at the time of signature or when depositing\nits instrument of ratification, acceptance or approval, specify the\nterritory or territories to which this Protocol shall apply.\n2. Any State may at any later date, by a declaration addressed\nto the Secretary General of the Council of Europe, extend the\napplication of this Protocol to any other territory specified in the\ndeclaration. In respect of such territory the Protocol shall enter into\nforce on the first day of the month following the date of receipt of\nsuch declaration by the Secretary General.\n42 43\n3. Any declaration made under the two preceding paragraphs\nmay, in respect of any territory specified in such declaration, be\nwithdrawn by a notification addressed to the Secretary General.\nThe withdrawal shall become effective on the first day of the\nmonth following the date of receipt of such notification by the\nSecretary General.\nARTICLE 6\nRelationship to the Convention\nAs between the States Parties the provisions of Articles 1 to 5 of this\nProtocol shall be regarded as additional Articles to the Convention\nand all the provisions of the Convention shall apply accordingly.\nARTICLE 7\nSignature and ratification\nThe Protocol shall be open for signature by the member States of\nthe Council of Europe, signatories to the Convention. It shall be\nsubject to ratification, acceptance or approval. A member State\nof the Council of Europe may not ratify, accept or approve this\nProtocol unless it has, simultaneously or previously, ratified the\nConvention. Instruments of ratification, acceptance or approval\nshall be deposited with the Secretary General of the Council of\nEurope.\nARTICLE 8\nEntry into force\n1. This Protocol shall enter into force on the first day of the month\nfollowing the date on which five member States of the Council of\nEurope have expressed their consent to be bound by the Protocol\nin accordance with the provisions of Article 7.\n2. In respect of any member State which subsequently expresses\nits consent to be bound by it, the Protocol shall enter into force on\nthe first day of the month following the date of the deposit of the\ninstrument of ratification, acceptance or approval.\nARTICLE 9\nDepositary functions\nThe Secretary General of the Council of Europe shall notify the\nmember States of the Council of:\n(a) any signature;\n(b) the deposit of any instrument of ratification, acceptance\nor approval;\n(c) any date of entry into force of this Protocol in accordance\nwith Articles 5 and 8;\n(d) any other act, notification or communication relating to\nthis Protocol.\nIn witness whereof the undersigned, being duly authorised thereto,\nhave signed this Protocol.\nDone at Strasbourg, this 28th day of April 1983, in English and in\nFrench, both texts being equally authentic, in a single copy which\nshall be deposited in the archives of the Council of Europe. The\nSecretary General of the Council of Europe shall transmit certified\ncopies to each member State of the Council of Europe.\n44 45\nProtocol No. 7\nto the Convention\nfor the Protection of Human Rights\nand Fundamental Freedoms\nStrasbourg, 22.XI.1984\nThe member States of the Council of Europe, signatory hereto,\nBeing resolved to take further steps to ensure the collective\nenforcement of certain rights and freedoms by means of the\nConvention for the Protection of Human Rights and Fundamental\nFreedoms signed at Rome on 4 November 1950 (hereinafter\nreferred to as “the Convention”),\nHave agreed as follows:\nARTICLE 1\nProcedural safeguards relating to expulsion of aliens\n1. An alien lawfully resident in the territory of a State shall not\nbe expelled therefrom except in pursuance of a decision reached\nin accordance with law and shall be allowed:\n(a) to submit reasons against his expulsion,\n(b) to have his case reviewed, and\n(c) to be represented for these purposes before the competent\nauthority or a person or persons designated by that\nauthority.\n2. An alien may be expelled before the exercise of his rights\nunder paragraph 1.(a), (b) and (c) of this Article, when such\nexpulsion is necessary in the interests of public order or is\ngrounded on reasons of national security.\nARTICLE 2\nRight of appeal in criminal matters\n1. Everyone convicted of a criminal offence by a tribunal shall\nhave the right to have his conviction or sentence reviewed by a\nhigher tribunal. The exercise of this right, including the grounds on\nwhich it may be exercised, shall be governed by law.\n2. This right may be subject to exceptions in regard to offences\nof a minor character, as prescribed by law, or in cases in which\nthe person concerned was tried in the first instance by the highest\ntribunal or was convicted following an appeal against acquittal.\nARTICLE 3\nCompensation for wrongful conviction\nWhen a person has by a final decision been convicted of a\ncriminal offence and when subsequently his conviction has been\nreversed, or he has been pardoned, on the ground that a new or\nnewly discovered fact shows conclusively that there has been a\nmiscarriage of justice, the person who has suffered punishment as\na result of such conviction shall be compensated according to the\nlaw or the practice of the State concerned, unless it is proved that\nthe non-disclosure of the unknown fact in time is wholly or\npartly attributable to him.\n46 47\nARTICLE 4\nRight not to be tried or punished twice\n1. No one shall be liable to be tried or punished again in criminal\nproceedings under the jurisdiction of the same State for an offence\nfor which he has already been finally acquitted or convicted in\naccordance with the law and penal procedure of that State.\n2. The provisions of the preceding paragraph shall not prevent\nthe reopening of the case in accordance with the law and penal\nprocedure of the State concerned, if there is evidence of new or\nnewly discovered facts, or if there has been a fundamental defect\nin the previous proceedings, which could affect the outcome of the\ncase.\n3. No derogation from this Article shall be made under\nArticle15 of the Convention.\nARTICLE 5\nEquality between spouses\nSpouses shall enjoy equality of rights and responsibilities of a\nprivate law character between them, and in their relations with\ntheir children, as to marriage, during marriage and in the event\nof its dissolution. This Article shall not prevent States from taking\nsuch measures as are necessary in the interests of the children.\nARTICLE 6\nTerritorial application\n1. Any State may at the time of signature or when depositing\nits instrument of ratification, acceptance or approval, specify the\nterritory or territories to which the Protocol shall apply and State\nthe extent to which it undertakes that the provisions of this Protocol\nshall apply to such territory or territories.\n2. Any State may at any later date, by a declaration addressed\nto the Secretary General of the Council of Europe, extend the\napplication of this Protocol to any other territory specified in the\ndeclaration. In respect of such territory the Protocol shall enter\ninto force on the first day of the month following the expiration of\na period of two months after the date of receipt by the Secretary\nGeneral of such declaration.\n3. Any declaration made under the two preceding paragraphs\nmay, in respect of any territory specified in such declaration,\nbe withdrawn or modified by a notification addressed to the\nSecretary General. The withdrawal or modification shall become\neffective on the first day of the month following the expiration of a\nperiod of two months after the date of receipt of such notification\nby the Secretary General.\n4. A declaration made in accordance with this Article shall be\ndeemed to have been made in accordance with paragraph 1 of\nArticle 56 of the Convention.\n5. The territory of any State to which this Protocol applies by\nvirtue of ratification, acceptance or approval by that State, and\neach territory to which this Protocol is applied by virtue of a\ndeclaration by that State under this Article, may be treated as\nseparate territories for the purpose of the reference in Article 1 to\nthe territory of a State.\n6. Any State which has made a declaration in accordance\nwith paragraph 1 or 2 of this Article may at any time\nthereafter declare on behalf of one or more of the territories\nto which the declaration relates that it accepts the competence\nof the Court to receive applications from individuals, nongovernmental organisations or groups of individuals as\nprovided in Article 34 of the Convention in respect of Articles 1\nto 5 of this Protocol.\n48 49\nARTICLE 7\nRelationship to the Convention\nAs between the States Parties, the provisions of Article 1 to 6\nof this Protocol shall be regarded as additional Articles to the\nConvention, and all the provisions of the Convention shall apply\naccordingly.\nARTICLE 8\nSignature and ratification\nThis Protocol shall be open for signature by member States of the\nCouncil of Europe which have signed the Convention. It is subject\nto ratification, acceptance or approval. A member State of the\nCouncil of Europe may not ratify, accept or approve this Protocol\nwithout previously or simultaneously ratifying the Convention.\nInstruments of ratification, acceptance or approval shall be\ndeposited with the Secretary General of the Council of Europe.\nARTICLE 9\nEntry into force\n1. This Protocol shall enter into force on the first day of the\nmonth following the expiration of a period of two months after\nthe date on which seven member States of the Council of Europe\nhave expressed their consent to be bound by the Protocol in\naccordance with the provisions of Article 8.\n2. In respect of any member State which subsequently expresses\nits consent to be bound by it, the Protocol shall enter into force\non the first day of the month following the expiration of a period\nof two months after the date of the deposit of the instrument of\nratification, acceptance or approval.\nARTICLE 10\nDepositary functions\nThe Secretary General of the Council of Europe shall notify all the\nmember States of the Council of Europe of:\n(a) any signature;\n(b) the deposit of any instrument of ratification, acceptance\nor approval;\n(c) any date of entry into force of this Protocol in accordance\nwith Articles 6 and 9;\n(d) any other act, notification or declaration relating to this\nProtocol.\nIn witness whereof the undersigned, being duly authorised thereto,\nhave signed this Protocol.\nDone at Strasbourg, this 22nd day of November 1984, in English\nand French, both texts being equally authentic, in a single copy\nwhich shall be deposited in the archives of the Council of Europe.\nThe Secretary General of the Council of Europe shall transmit\ncertified copies to each member State of the Council of Europe.\n50 51\nProtocol No. 12\nto the Convention\nfor the Protection of Human Rights\nand Fundamental Freedoms\nRome, 4.XI.2000\nThe member States of the Council of Europe, signatory hereto,\nHaving regard to the fundamental principle according to which\nall persons are equal before the law and are entitled to the equal\nprotection of the law;\nBeing resolved to take further steps to promote the equality of all\npersons through the collective enforcement of a general prohibition\nof discrimination by means of the Convention for the Protection\nof Human Rights and Fundamental Freedoms signed at Rome\non 4 November 1950 (hereinafter referred to as “the Convention”);\nReaffirming that the principle of non-discrimination does not\nprevent States Parties from taking measures in order to promote\nfull and effective equality, provided that there is an objective and\nreasonable justification for those measures,\nHave agreed as follows:\nARTICLE 1\nGeneral prohibition of discrimination\n1. The enjoyment of any right set forth by law shall be secured\nwithout discrimination on any ground such as sex, race, colour,\nlanguage, religion, political or other opinion, national or social\norigin, association with a national minority, property, birth or\nother status.\n2. No one shall be discriminated against by any public authority\non any ground such as those mentioned in paragraph 1.\nARTICLE 2\nTerritorial application\n1. Any State may, at the time of signature or when depositing\nits instrument of ratification, acceptance or approval, specify the\nterritory or territories to which this Protocol shall apply.\n2. Any State may at any later date, by a declaration addressed\nto the Secretary General of the Council of Europe, extend the\napplication of this Protocol to any other territory specified in the\ndeclaration. In respect of such territory the Protocol shall enter into\nforce on the first day of the month following the expiration of a\nperiod of three months after the date of receipt by the Secretary\nGeneral of such declaration.\n3. Any declaration made under the two preceding paragraphs\nmay, in respect of any territory specified in such declaration,\nbe withdrawn or modified by a notification addressed to the\nSecretary General of the Council of Europe. The withdrawal or\nmodification shall become effective on the first day of the month\nfollowing the expiration of a period of three months after the date\nof receipt of such notification by the Secretary General.\n52 53\n4. A declaration made in accordance with this Article shall be\ndeemed to have been made in accordance with paragraph 1 of\nArticle 56 of the Convention.\n5. Any State which has made a declaration in accordance with\nparagraph 1 or 2 of this Article may at any time thereafter declare\non behalf of one or more of the territories to which the declaration\nrelates that it accepts the competence of the Court to receive\napplications from individuals, non-governmental organisations or\ngroups of individuals as provided by Article 34 of the Convention\nin respect of Article 1 of this Protocol.\nARTICLE 3\nRelationship to the Convention\nAs between the States Parties, the provisions of Articles 1\nand 2 of this Protocol shall be regarded as additional Articles\nto the Convention, and all the provisions of the Convention shall\napply accordingly.\nARTICLE 4\nSignature and ratification\nThis Protocol shall be open for signature by member States of the\nCouncil of Europe which have signed the Convention. It is subject\nto ratification, acceptance or approval. A member State of the\nCouncil of Europe may not ratify, accept or approve this Protocol\nwithout previously or simultaneously ratifying the Convention.\nInstruments of ratification, acceptance or approval shall be\ndeposited with the Secretary General of the Council of Europe.\nARTICLE 5\nEntry into force\n1. This Protocol shall enter into force on the first day of the\nmonth following the expiration of a period of three months after\nthe date on which ten member States of the Council of Europe\nhave expressed their consent to be bound by the Protocol in\naccordance with the provisions of Article 4.\n2. In respect of any member State which subsequently expresses\nits consent to be bound by it, the Protocol shall enter into force\non the first day of the month following the expiration of a period\nof three months after the date of the deposit of the instrument of\nratification, acceptance or approval.\nARTICLE 6\nDepositary functions\nThe Secretary General of the Council of Europe shall notify all the\nmember States of the Council of Europe of:\n(a) any signature;\n(b) the deposit of any instrument of ratification, acceptance\nor approval;\n(c) any date of entry into force of this Protocol in accordance\nwith Articles 2 and 5;\n(d) any other act, notification or communication relating to\nthis Protocol.\nIn witness whereof the undersigned, being duly authorised thereto,\nhave signed this Protocol.\nDone at Rome, this 4th day of November 2000, in English and in\nFrench, both texts being equally authentic, in a single copy which\nshall be deposited in the archives of the Council of Europe. The\nSecretary General of the Council of Europe shall transmit certified\ncopies to each member State of the Council of Europe.\n54 55\nProtocol No. 13\nto the Convention\nfor the Protection of Human Rights\nand Fundamental Freedoms\nconcerning the abolition of the death\npenalty in all circumstances\nVilnius, 3.V.2002\nThe member States of the Council of Europe, signatory hereto,\nConvinced that everyone’s right to life is a basic value in a\ndemocratic society and that the abolition of the death penalty is\nessential for the protection of this right and for the full recognition\nof the inherent dignity of all human beings;\nWishing to strengthen the protection of the right to life guaranteed\nby the Convention for the Protection of Human Rights and\nFundamental Freedoms signed at Rome on 4 November 1950\n(hereinafter referred to as “the Convention”);\nNoting that Protocol No. 6 to the Convention, concerning\nthe Abolition of the Death Penalty, signed at Strasbourg\non 28 April 1983, does not exclude the death penalty in respect\nof acts committed in time of war or of imminent threat of war;\nBeing resolved to take the final step in order to abolish the death\npenalty in all circumstances,\nHave agreed as follows:\nARTICLE 1\nAbolition of the death penalty\nThe death penalty shall be abolished. No one shall be condemned\nto such penalty or executed.\nARTICLE 2\nProhibition of derogations\nNo derogation from the provisions of this Protocol shall be made\nunder Article 15 of the Convention.\nARTICLE 3\nProhibition of reservations\nNo reservation may be made under Article 57 of the Convention\nin respect of the provisions of this Protocol.\nARTICLE 4\nTerritorial application\n1. Any State may, at the time of signature or when depositing\nits instrument of ratification, acceptance or approval, specify the\nterritory or territories to which this Protocol shall apply.\n2. Any State may at any later date, by a declaration addressed\nto the Secretary General of the Council of Europe, extend the\napplication of this Protocol to any other territory specified in the\ndeclaration. In respect of such territory the Protocol shall enter into\nforce on the first day of the month following the expiration of a\nperiod of three months after the date of receipt by the Secretary\nGeneral of such declaration.\n56 57\n3. Any declaration made under the two preceding paragraphs\nmay, in respect of any territory specified in such declaration,\nbe withdrawn or modified by a notification addressed to the\nSecretary General. The withdrawal or modification shall become\neffective on the first day of the month following the expiration of a\nperiod of three months after the date of receipt of such notification\nby the Secretary General.\nARTICLE 5\nRelationship to the Convention\nAs between the States Parties the provisions of Articles 1 to 4 of this\nProtocol shall be regarded as additional Articles to the Convention,\nand all the provisions of the Convention shall apply accordingly.\nARTICLE 6\nSignature and ratification\nThis Protocol shall be open for signature by member States of the\nCouncil of Europe which have signed the Convention. It is subject\nto ratification, acceptance or approval. A member State of the\nCouncil of Europe may not ratify, accept or approve this Protocol\nwithout previously or simultaneously ratifying the Convention.\nInstruments of ratification, acceptance or approval shall be\ndeposited with the Secretary General of the Council of Europe.\nARTICLE 7\nEntry into force\n1. This Protocol shall enter into force on the first day of the\nmonth following the expiration of a period of three months after\nthe date on which ten member States of the Council of Europe\nhave expressed their consent to be bound by the Protocol in\naccordance with the provisions of Article 6.\n2. In respect of any member State which subsequently expresses\nits consent to be bound by it, the Protocol shall enter into force\non the first day of the month following the expiration of a period\nof three months after the date of the deposit of the instrument of\nratification, acceptance or approval.\nARTICLE 8\nDepositary functions\nThe Secretary General of the Council of Europe shall notify all the\nmember States of the Council of Europe of:\n(a) any signature;\n(b) the deposit of any instrument of ratification, acceptance\nor approval;\n(c) any date of entry into force of this Protocol in accordance\nwith Articles 4 and 7;\n(d) any other act, notification or communication relating to\nthis Protocol.\nIn witness whereof the undersigned, being duly authorised thereto,\nhave signed this Protocol.\nDone at Vilnius, this 3rd day of May 2002, in English and in\nFrench, both texts being equally authentic, in a single copy which\nshall be deposited in the archives of the Council of Europe. The\nSecretary General of the Council of Europe shall transmit certified\ncopies to each member State of the Council of Europe.\n58 59\nProtocol No. 16\nto the Convention on the\nProtection of Human Rights\nand Fundamental Freedoms\nStrasbourg, 2.X.2013\nThe member States of the Council of Europe and other High\nContracting Parties to the Convention for the Protection of Human\nRights and Fundamental Freedoms, signed at Rome on 4 November\n1950 (hereinafter referred to as “the Convention”), signatories\nhereto,\nHaving regard to the provisions of the Convention and, in\nparticular, Article 19 establishing the European Court of Human\nRights (hereinafter referred to as “the Court”);\nConsidering that the extension of the Court’s competence to\ngive advisory opinions will further enhance the interaction\nbetween the Court and national authorities and thereby reinforce\nimplementation of the Convention, in accordance with the\nprinciple of subsidiarity;\nHaving regard to Opinion No. 285 (2013) adopted by the\nParliamentary Assembly of the Council of Europe on 28 June 2013,\nHave agreed as follows:\nARTICLE 1\n1. Highest courts and tribunals of a High Contracting Party, as\nspecified in accordance with Article 10, may request the Court\nto give advisory opinions on questions of principle relating to the\ninterpretation or application of the rights and freedoms defined in\nthe Convention or the protocols thereto.\n2. The requesting court or tribunal may seek an advisory opinion\nonly in the context of a case pending before it.\n3. The requesting court or tribunal shall give reasons for\nits request and shall provide the relevant legal and factual\nbackground of the pending case.\nARTICLE 2\n1. A panel of five judges of the Grand Chamber shall decide\nwhether to accept the request for an advisory opinion, having\nregard to Article 1. The panel shall give reasons for any refusal to\naccept the request.\n2. If the panel accepts the request, the Grand Chamber shall\ndeliver the advisory opinion.\n3. The panel and the Grand Chamber, as referred to in the\npreceding paragraphs, shall include ex officio the judge elected\nin respect of the High Contracting Party to which the requesting\ncourt or tribunal pertains. If there is none or if that judge is unable\nto sit, a person chosen by the President of the Court from a list\nsubmitted in advance by that Party shall sit in the capacity of\njudge.\n60 61\nARTICLE 7\n1. This Protocol shall be open for signature by the High\nContracting Parties to the Convention, which may express their\nconsent to be bound by:\n(a) signature without reservation as to ratification, acceptance\nor approval; or\n(b) signature subject to ratification, acceptance or approval,\nfollowed by ratification, acceptance or approval.\n2. The instruments of ratification, acceptance or approval shall\nbe deposited with the Secretary General of the Council of Europe.\nARTICLE 8\n1. This Protocol shall enter into force on the first day of the\nmonth following the expiration of a period of three months after\nthe date on which ten High Contracting Parties to the Convention\nhave expressed their consent to be bound by the Protocol in\naccordance with the provisions of Article 7.\n2. In respect of any High Contracting Party to the Convention\nwhich subsequently expresses its consent to be bound by it,\nthe Protocol shall enter into force on the first day of the month\nfollowing the expiration of a period of three months after the date\nof the expression of its consent to be bound by the Protocol in\naccordance with the provisions of Article 7.\nARTICLE 9\nNo reservation may be made under Article 57 of the Convention\nin respect of the provisions of this Protocol.\nARTICLE 3\nThe Council of Europe Commissioner for Human Rights and the\nHigh Contracting Party to which the requesting court or tribunal\npertains shall have the right to submit written comments and take\npart in any hearing. The President of the Court may, in the interest\nof the proper administration of justice, invite any other High\nContracting Party or person also to submit written comments or\ntake part in any hearing.\nARTICLE 4\n1. Reasons shall be given for advisory opinions.\n2. If the advisory opinion does not represent, in whole or in\npart, the unanimous opinion of the judges, any judge shall be\nentitled to deliver a separate opinion.\n3. Advisory opinions shall be communicated to the requesting\ncourt or tribunal and to the High Contracting Party to which that\ncourt or tribunal pertains.\n4. Advisory opinions shall be published.\nARTICLE 5\nAdvisory opinions shall not be binding.\nARTICLE 6\nAs between the High Contracting Parties the provisions of Articles 1\nto 5 of this Protocol shall be regarded as additional articles to the\nConvention, and all the provisions of the Convention shall apply\naccordingly. \n62\nARTICLE 10\nEach High Contracting Party to the Convention shall, at the time\nof signature or when depositing its instrument of ratification,\nacceptance or approval, by means of a declaration addressed\nto the Secretary General of the Council of Europe, indicate the\ncourts or tribunals that it designates for the purposes of Article 1,\nparagraph 1, of this Protocol. This declaration may be modified\nat any later date and in the same manner.\nARTICLE 11\nThe Secretary General of the Council of Europe shall notify the\nmember States of the Council of Europe and the other High\nContracting Parties to the Convention of:\n(a) a any signature;\n(b) the deposit of any instrument of ratification, acceptance\nor approval;\n(c) any date of entry into force of this Protocol in accordance\nwith Article 8;\n(d) any declaration made in accordance with Article 10; and\n(e) any other act, notification or communication relating to\nthis Protocol.\nIn witness whereof the undersigned, being duly authorised thereto,\nhave signed this Protocol.\nDone at Strasbourg, this 2nd day of October 2013, in English and\nFrench, both texts being equally authentic, in a single copy which\nshall be deposited in the archives of the Council of Europe. The\nSecretary General of the Council of Europe shall transmit certified\ncopies to each member State of the Council of Europe and to the\nother High Contracting Parties to the Convention.\nEuropean Convention on Human Rights\nDesign: © ECHR - Photo: © Shutterstock\nwww.ec hr.coe.int\nEuropean Court of Human Rights\nCouncil of Europe\n67075 Strasbourg cedex\nFrance\nENG\n", "metadata": {"country": "Europe", "year": "1998", "legally_binding": "Yes", "binding_proof": "Convention,International Treaty", "date": "", "regulator": "Cw", "type": "Convention", "status": " ", "language": "EN", "use_cases": "[1,2, 3, 4, 5, 6]"}}
